[
  {
    "date": "2025-07-26",
    "quote": "Let them grow together until harvest; then at harvest time I will say to the harvesters, 'First collect the weeds and tie them in bundles for burning; but gather the wheat into my barn.' (Mt 13:30)",
    "reading_summary": "Moses shares the commandments, and Israel commits to the covenant sealed with blood, signifying divine relationship.",
    "psalm_summary": "Praise and thanksgiving from a sincere heart; God promises deliverance to those who call upon Him.",
    "gospel_summary": "Parable of weeds and wheat: God allows good and evil to grow together until the final judgment.",
    "saint_reflection": "Saints Joachim and Anne exemplify quiet faith and generational devotion to God’s plan.",
    "daily_prayer": "Lord, may our families build legacies of faith and holiness like Saints Joachim and Anne.",
    "exegesis": "Exodus reveals the covenant sealed in blood; Matthew’s parable urges patience in God's justice. Saints Joachim and Anne highlight faithful preparation for God's greater work.",
    "modern_links": "Legacy is not always loud. Saints Joachim and Anne quietly nurtured the Mother of God. Faithfulness in the hidden years prepares for miracles.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072625.cfm"
  },
  {
    "date": "2025-07-27",
    "quote": "Ask and you will receive; seek and you will find; knock and the door will be opened to you. (Lk 11:9)",
    "reading_summary": "Abraham intercedes boldly for Sodom; we are made alive in Christ through forgiveness.",
    "psalm_summary": "The psalm celebrates God’s faithful response to prayer, urging trust.",
    "gospel_summary": "Jesus teaches the Lord’s Prayer and encourages persistent, hopeful prayer.",
    "saint_reflection": "Abraham’s intercession is a model of love-driven advocacy and bold faith.",
    "daily_prayer": "Father, grant us boldness and trust to pray without ceasing.",
    "exegesis": "Genesis 18 highlights intercessory prayer; Colossians proclaims life in Christ; Luke’s Gospel teaches prayer rooted in trust. Prayer links all readings.",
    "modern_links": "In an age of instant answers, God invites us to ask, seek, knock—and wait in faith.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072725.cfm"
  },
  {
    "date": "2025-07-28",
    "quote": "The kingdom of heaven is like a mustard seed...the smallest of all seeds, but when it is full-grown it is the largest of plants. (Mt 13:31-32)",
    "reading_summary": "Moses prays for Israel after their idolatry; he advocates for mercy.",
    "psalm_summary": "Psalm 106 recalls Israel’s failure at Sinai and Moses’ intercession.",
    "gospel_summary": "Jesus compares God’s Kingdom to a mustard seed and yeast—small beginnings, big transformation.",
    "saint_reflection": "Faith starts small but grows into shelter for others.",
    "daily_prayer": "Lord, grow our faith into a place of peace for others.",
    "exegesis": "From Moses’ plea to Jesus’ parable, today's readings highlight transformation—through prayer, patience, and grace.",
    "modern_links": "Don’t underestimate the small prayers, the silent service, the unnoticed mercy. God's Kingdom begins there.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072825.cfm"
  },
  {
    "date": "2025-07-29",
    "quote": "I am the resurrection and the life. (Jn 11:25)",
    "reading_summary": "Moses meets with God and his face shines; a sign of divine encounter.",
    "psalm_summary": "Psalm 99 praises God’s holiness and reverence at His presence.",
    "gospel_summary": "Jesus raises Lazarus, declaring power over death and offering new life.",
    "saint_reflection": "Saint Martha’s faith shows courage even amid sorrow.",
    "daily_prayer": "Jesus, in our grief, remind us that You are the resurrection and the life.",
    "exegesis": "Exodus and John’s Gospel portray God’s glory—through Moses and Christ. The glory that transforms death into life.",
    "modern_links": "Grief does not silence faith. Martha believed while burying her brother—and Jesus came.",
    "usccb_link": "https://bible.usccb.org/bible/readings/072925.cfm"
  },
  {
    "date": "2025-07-30",
    "quote": "The Kingdom of heaven is like a net thrown into the sea. (Mt 13:47)",
    "reading_summary": "God’s name is proclaimed as compassionate, faithful, and just.",
    "psalm_summary": "Psalm 103 blesses the Lord for mercy and love.",
    "gospel_summary": "Parable of the net: God’s final judgment will separate the good and the wicked.",
    "saint_reflection": "Saint Peter Chrysologus spoke truth with clarity and conviction.",
    "daily_prayer": "Lord, help us live so we are found among the faithful.",
    "exegesis": "Exodus 34 and Matthew 13 both declare God’s justice and mercy—a call to holiness.",
    "modern_links": "You are caught in God’s net of mercy every day. Live as one who belongs in His boat.",
    "usccb_link": "https://bible.usccb.org/bible/readings/073025.cfm"
  },
  {
    "date": "2025-07-31",
    "quote": "Whatever you do, do everything for the glory of God. (1 Cor 10:31)",
    "reading_summary": "Moses blesses the tribes; he is granted sight of the Promised Land.",
    "psalm_summary": "Psalm 66 praises God’s mighty deeds and invites joyful worship.",
    "gospel_summary": "Jesus likens scribes of the Kingdom to those bringing out both old and new treasure.",
    "saint_reflection": "Saint Ignatius of Loyola taught 'Ad Majorem Dei Gloriam'—for the greater glory of God.",
    "daily_prayer": "Lord, help us to live with purpose and passion for Your glory.",
    "exegesis": "Deuteronomy and Matthew call for wisdom that honors tradition and applies it anew. Ignatius exemplifies this harmony.",
    "modern_links": "In every task—mundane or grand—there is a way to glorify God. Saint Ignatius made that his life's motto.",
    "usccb_link": "https://bible.usccb.org/bible/readings/073125.cfm"
  },
  {
    "date": "2025-08-01",
    "quote": "Whoever exalts himself will be humbled; but whoever humbles himself will be exalted. (Lk 14:11)",
    "reading_summary": "Moses reminds Israel to keep God's covenant; humility is commanded.",
    "psalm_summary": "Psalm 18 praises God's deliverance and strength for the humble.",
    "gospel_summary": "Jesus teaches humility and the proper posture of heart before God.",
    "saint_reflection": "Saint Alphonsus Liguori chose mercy over rigor in teaching faith.",
    "daily_prayer": "Jesus, help us choose the lower place and trust You to lift us up.",
    "exegesis": "Deuteronomy emphasizes obedience with humility; Luke reinforces the divine reversal through humility. Saint Alphonsus lived that reversal.",
    "modern_links": "The lowest seat at the table is the one Jesus most often takes. Sit beside Him there.",
    "usccb_link": "https://bible.usccb.org/bible/readings/080125.cfm"
  },
  {
    "date": "2025-08-02",
    "quote": "Let the children come to me, and do not prevent them. (Mt 19:14)",
    "reading_summary": "Moses reminds the people to teach God’s law to their children daily.",
    "psalm_summary": "Psalm 147 celebrates God’s care for Jerusalem and its children.",
    "gospel_summary": "Jesus welcomes children, affirming their dignity and openness to the Kingdom.",
    "saint_reflection": "Saint Eusebius of Vercelli stood firm in defending the truth of Christ amid heresy.",
    "daily_prayer": "Jesus, help us protect and welcome the faith of children.",
    "exegesis": "The readings tie together teaching, welcome, and spiritual simplicity. Saint Eusebius defended truth, even as Jesus welcomed innocence.",
    "modern_links": "Catechesis starts at bedtime and breakfast. Talk to your kids about God—He’s already talking to them.",
    "usccb_link": "https://bible.usccb.org/bible/readings/080225.cfm"
  },
  {
    "date": "2025-08-03",
    "quote": "They all ate and were satisfied. (Mt 14:20)",
    "reading_summary": "Isaiah calls everyone to a free banquet; Paul urges trust in God’s love; Jesus feeds thousands.",
    "psalm_summary": "Psalm 145 praises God’s provision and compassion.",
    "gospel_summary": "Jesus multiplies loaves and fishes, revealing divine abundance.",
    "saint_reflection": "Eighteenth Sunday in Ordinary Time—God's abundance meets our need.",
    "daily_prayer": "Lord, when we feel empty, feed us with Your love.",
    "exegesis": "Isaiah’s invitation to the feast is fulfilled in Christ’s miraculous feeding. Romans assures us nothing can separate us from that love.",
    "modern_links": "God never runs out. Come hungry. Come often.",
    "usccb_link": "https://bible.usccb.org/bible/readings/080325.cfm"
  }
]