 {
    "date": "2025-07-26",
    "quote": "When fear pursues you like Pharaoh’s chariots… the tomb breaks open.",
    "citation": "Exodus 14:14",
    "lectio_links": "Moses stretches out his hand, the sea parts, and faith is revealed.",
    "psalm_links": "The Lord is my strength and my song; He has become my salvation.",
    "gospel_links": "No sign will be given except the sign of Jonah — three days in the tomb, now risen.",
    "prayer": "Lord God of Exodus and Easter… Through Jesus—greater than prophet, king, and every expectation—Amen.",
    "modern_links": "The world chases power and fear. The tomb breaks open. Grace walks out. Follow Him."
  },
  {
    "date": "2025-07-27",
    "quote": "The kingdom of heaven is like a treasure hidden in a field.",
    "citation": "Matthew 13:44",
    "lectio_links": "Solomon asks for wisdom, not riches. God gives him both.",
    "psalm_links": "Lord, I love your commands more than gold, more than fine gold.",
    "gospel_links": "The kingdom is hidden, growing, rising, leavening the world.",
    "prayer": "Lord, give me a discerning heart and eyes for your treasure. Let me sell all for your joy.",
    "modern_links": "Hidden treasure is buried in the ordinary. Dig deep. What glitters might not last—but grace does."
  },
  {
    "date": "2025-07-28",
    "quote": "The tent was set up according to the Lord’s instructions.",
    "citation": "Exodus 40:16",
    "lectio_links": "Moses builds the tabernacle, and God’s glory fills it.",
    "psalm_links": "How lovely is your dwelling place, O Lord of hosts!",
    "gospel_links": "Even angels long to see what the disciples are shown.",
    "prayer": "Dwell in me, O Lord. Let my soul be a tent for your glory.",
    "modern_links": "God still fills spaces—coffee tables, cubicles, quiet corners. Make room."
  },
  {
    "date": "2025-07-29",
    "quote": "I am the resurrection and the life.",
    "citation": "John 11:25",
    "lectio_links": "Martha believes, even before the miracle. Lazarus lives.",
    "psalm_links": "My soul waits for the Lord more than watchmen for the morning.",
    "gospel_links": "Jesus weeps. Then he commands: come forth!",
    "prayer": "Lord, raise what is dead in me. Give me Martha’s faith and Lazarus’ joy.",
    "modern_links": "Hope is not naive. It's what calls dead hearts to rise again."
  },
  {
    "date": "2025-07-30",
    "quote": "The Lord passed by in a cloud and proclaimed His name.",
    "citation": "Exodus 34:5",
    "lectio_links": "God reveals His name and glory to Moses on the mountain.",
    "psalm_links": "The Lord is kind and merciful, slow to anger, rich in compassion.",
    "gospel_links": "The good fish are gathered; the bad discarded. Judgment is real.",
    "prayer": "Reveal yourself, Lord. Let your name be proclaimed in my life.",
    "modern_links": "Grace isn’t soft. It’s full of fire and forgiveness. Don’t mistake kindness for weakness."
  },
  {
    "date": "2025-07-31",
    "quote": "Choose today whom you will serve.",
    "citation": "Joshua 24:15",
    "lectio_links": "Joshua reminds Israel to choose: gods of Egypt or the Lord.",
    "psalm_links": "Taste and see the goodness of the Lord.",
    "gospel_links": "The scribes trained for the kingdom bring out new and old treasures.",
    "prayer": "I choose You again today, Lord. Let my heart never grow divided.",
    "modern_links": "Each day offers a hundred small altars. Who you serve is written in your habits."
  }